Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/adchs.h
#define ADCHS_ADCGIRQEN1_AGIEN0_Pos           _UINT32_(0)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 0 Position */
#define ADCHS_ADCGIRQEN1_AGIEN0_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN0_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 0 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN0(value)        (ADCHS_ADCGIRQEN1_AGIEN0_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN0_Pos)) /* Assignment of value for AGIEN0 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN0_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN0_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN0_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN0_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN0_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN0_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN0_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN0_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN1_Pos           _UINT32_(1)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 1 Position */
#define ADCHS_ADCGIRQEN1_AGIEN1_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN1_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 1 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN1(value)        (ADCHS_ADCGIRQEN1_AGIEN1_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN1_Pos)) /* Assignment of value for AGIEN1 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN1_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN1_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN1_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN1_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN1_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN1_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN1_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN1_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN2_Pos           _UINT32_(2)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 2 Position */
#define ADCHS_ADCGIRQEN1_AGIEN2_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN2_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 2 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN2(value)        (ADCHS_ADCGIRQEN1_AGIEN2_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN2_Pos)) /* Assignment of value for AGIEN2 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN2_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN2_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN2_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN2_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN2_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN2_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN2_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN2_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN3_Pos           _UINT32_(3)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 3 Position */
#define ADCHS_ADCGIRQEN1_AGIEN3_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN3_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 3 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN3(value)        (ADCHS_ADCGIRQEN1_AGIEN3_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN3_Pos)) /* Assignment of value for AGIEN3 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN3_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN3_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN3_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN3_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN3_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN3_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN3_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN3_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN4_Pos           _UINT32_(4)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 4 Position */
#define ADCHS_ADCGIRQEN1_AGIEN4_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN4_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 4 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN4(value)        (ADCHS_ADCGIRQEN1_AGIEN4_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN4_Pos)) /* Assignment of value for AGIEN4 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN4_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN4_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN4_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN4_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN4_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN4_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN4_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN4_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN5_Pos           _UINT32_(5)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 5 Position */
#define ADCHS_ADCGIRQEN1_AGIEN5_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN5_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 5 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN5(value)        (ADCHS_ADCGIRQEN1_AGIEN5_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN5_Pos)) /* Assignment of value for AGIEN5 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN5_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN5_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN5_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN5_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN5_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN5_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN5_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN5_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN6_Pos           _UINT32_(6)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 6 Position */
#define ADCHS_ADCGIRQEN1_AGIEN6_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN6_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 6 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN6(value)        (ADCHS_ADCGIRQEN1_AGIEN6_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN6_Pos)) /* Assignment of value for AGIEN6 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN6_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN6_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN6_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN6_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN6_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN6_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN6_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN6_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN7_Pos           _UINT32_(7)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 7 Position */
#define ADCHS_ADCGIRQEN1_AGIEN7_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN7_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 7 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN7(value)        (ADCHS_ADCGIRQEN1_AGIEN7_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN7_Pos)) /* Assignment of value for AGIEN7 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN7_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN7_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN7_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN7_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN7_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN7_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN7_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN7_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN8_Pos           _UINT32_(8)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 8 Position */
#define ADCHS_ADCGIRQEN1_AGIEN8_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN8_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 8 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN8(value)        (ADCHS_ADCGIRQEN1_AGIEN8_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN8_Pos)) /* Assignment of value for AGIEN8 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN8_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN8_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN8_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN8_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN8_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN8_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN8_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN8_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN9_Pos           _UINT32_(9)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 9 Position */
#define ADCHS_ADCGIRQEN1_AGIEN9_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN9_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 9 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN9(value)        (ADCHS_ADCGIRQEN1_AGIEN9_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN9_Pos)) /* Assignment of value for AGIEN9 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN9_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN9_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN9_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN9_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN9_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN9_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN9_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN9_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN10_Pos          _UINT32_(10)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 10 Position */
#define ADCHS_ADCGIRQEN1_AGIEN10_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN10_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 10 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN10(value)       (ADCHS_ADCGIRQEN1_AGIEN10_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN10_Pos)) /* Assignment of value for AGIEN10 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN10_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN10_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN10_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN10_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN10_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN10_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN10_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN10_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN11_Pos          _UINT32_(11)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 11 Position */
#define ADCHS_ADCGIRQEN1_AGIEN11_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN11_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 11 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN11(value)       (ADCHS_ADCGIRQEN1_AGIEN11_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN11_Pos)) /* Assignment of value for AGIEN11 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN11_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN11_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN11_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN11_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN11_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN11_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN11_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN11_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN12_Pos          _UINT32_(12)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 12 Position */
#define ADCHS_ADCGIRQEN1_AGIEN12_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN12_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 12 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN12(value)       (ADCHS_ADCGIRQEN1_AGIEN12_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN12_Pos)) /* Assignment of value for AGIEN12 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN12_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN12_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN12_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN12_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN12_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN12_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN12_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN12_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN13_Pos          _UINT32_(13)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 13 Position */
#define ADCHS_ADCGIRQEN1_AGIEN13_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN13_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 13 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN13(value)       (ADCHS_ADCGIRQEN1_AGIEN13_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN13_Pos)) /* Assignment of value for AGIEN13 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN13_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN13_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN13_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN13_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN13_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN13_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN13_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN13_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN14_Pos          _UINT32_(14)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 14 Position */
#define ADCHS_ADCGIRQEN1_AGIEN14_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN14_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 14 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN14(value)       (ADCHS_ADCGIRQEN1_AGIEN14_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN14_Pos)) /* Assignment of value for AGIEN14 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN14_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN14_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN14_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN14_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN14_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN14_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN14_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN14_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN15_Pos          _UINT32_(15)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 15 Position */
#define ADCHS_ADCGIRQEN1_AGIEN15_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN15_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 15 Mask */
#define ADCHS_ADCGIRQEN1_AGIEN15(value)       (ADCHS_ADCGIRQEN1_AGIEN15_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN15_Pos)) /* Assignment of value for AGIEN15 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN15_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN15_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN15_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN15_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN15_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position */
#define ADCHS_ADCGIRQEN1_AGIEN15_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN15_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN15_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position */
#define ADCHS_ADCGIRQEN1_AGIEN16_Pos          _UINT32_(16)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 16 Position */
#define ADCHS_ADCGIRQEN1_AGIEN16_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN16_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit 16 Mask */
