Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/adchs.h
#define ADCHS_ADCDSTAT1_ARDY_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDSTAT1 Position)  */
#define ADCHS_ADCDSTAT1_ARDY_Msk              (_UINT32_(0x7FFFFF) << ADCHS_ADCDSTAT1_ARDY_Pos)     /* (ADCHS_ADCDSTAT1 Mask) ARDY */
#define ADCHS_ADCDSTAT1_ARDY(value)           (ADCHS_ADCDSTAT1_ARDY_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY_Pos)) 

/* -------- ADCHS_ADCDSTAT1CLR : (ADCHS Offset: 0xC4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCDSTAT1CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCDSTAT1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCDSTAT1CLR_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCDSTAT1CLR) Register Mask  */


/* -------- ADCHS_ADCDSTAT1SET : (ADCHS Offset: 0xC8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCDSTAT1SET_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCDSTAT1SET) Bit set register  Reset Value */

#define ADCHS_ADCDSTAT1SET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCDSTAT1SET) Register Mask  */


/* -------- ADCHS_ADCDSTAT1INV : (ADCHS Offset: 0xCC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCDSTAT1INV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCDSTAT1INV) Bit invert register  Reset Value */

#define ADCHS_ADCDSTAT1INV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCDSTAT1INV) Register Mask  */


/* -------- ADCHS_ADCCMPEN1 : (ADCHS Offset: 0xE0) (R/W 32)  -------- */
#define ADCHS_ADCCMPEN1_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN1)   Reset Value */

#define ADCHS_ADCCMPEN1_CMPE0_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE0_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE0_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE0(value)          (ADCHS_ADCCMPEN1_CMPE0_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE0_Pos)) /* Assignment of value for CMPE0 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE1_Pos             _UINT32_(1)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE1_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE1_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE1(value)          (ADCHS_ADCCMPEN1_CMPE1_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE1_Pos)) /* Assignment of value for CMPE1 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE2_Pos             _UINT32_(2)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE2_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE2_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE2(value)          (ADCHS_ADCCMPEN1_CMPE2_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE2_Pos)) /* Assignment of value for CMPE2 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE3_Pos             _UINT32_(3)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE3_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE3_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE3(value)          (ADCHS_ADCCMPEN1_CMPE3_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE3_Pos)) /* Assignment of value for CMPE3 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE4_Pos             _UINT32_(4)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE4_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE4_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE4(value)          (ADCHS_ADCCMPEN1_CMPE4_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE4_Pos)) /* Assignment of value for CMPE4 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE5_Pos             _UINT32_(5)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE5_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE5_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE5(value)          (ADCHS_ADCCMPEN1_CMPE5_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE5_Pos)) /* Assignment of value for CMPE5 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE6_Pos             _UINT32_(6)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE6_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE6_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE6(value)          (ADCHS_ADCCMPEN1_CMPE6_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE6_Pos)) /* Assignment of value for CMPE6 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE7_Pos             _UINT32_(7)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE7_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE7_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE7(value)          (ADCHS_ADCCMPEN1_CMPE7_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE7_Pos)) /* Assignment of value for CMPE7 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE8_Pos             _UINT32_(8)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE8_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE8_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE8(value)          (ADCHS_ADCCMPEN1_CMPE8_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE8_Pos)) /* Assignment of value for CMPE8 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE9_Pos             _UINT32_(9)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE9_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE9_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE9(value)          (ADCHS_ADCCMPEN1_CMPE9_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE9_Pos)) /* Assignment of value for CMPE9 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE10_Pos            _UINT32_(10)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE10_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE10_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE10(value)         (ADCHS_ADCCMPEN1_CMPE10_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE10_Pos)) /* Assignment of value for CMPE10 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE11_Pos            _UINT32_(11)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE11_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE11_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE11(value)         (ADCHS_ADCCMPEN1_CMPE11_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE11_Pos)) /* Assignment of value for CMPE11 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE12_Pos            _UINT32_(12)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE12_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE12_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE12(value)         (ADCHS_ADCCMPEN1_CMPE12_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE12_Pos)) /* Assignment of value for CMPE12 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE13_Pos            _UINT32_(13)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE13_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE13_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE13(value)         (ADCHS_ADCCMPEN1_CMPE13_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE13_Pos)) /* Assignment of value for CMPE13 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE14_Pos            _UINT32_(14)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE14_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE14_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE14(value)         (ADCHS_ADCCMPEN1_CMPE14_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE14_Pos)) /* Assignment of value for CMPE14 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE15_Pos            _UINT32_(15)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE15_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE15_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE15(value)         (ADCHS_ADCCMPEN1_CMPE15_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE15_Pos)) /* Assignment of value for CMPE15 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE16_Pos            _UINT32_(16)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE16_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE16_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE16(value)         (ADCHS_ADCCMPEN1_CMPE16_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE16_Pos)) /* Assignment of value for CMPE16 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE17_Pos            _UINT32_(17)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE17_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE17_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE17(value)         (ADCHS_ADCCMPEN1_CMPE17_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE17_Pos)) /* Assignment of value for CMPE17 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE18_Pos            _UINT32_(18)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE18_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE18_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE18(value)         (ADCHS_ADCCMPEN1_CMPE18_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE18_Pos)) /* Assignment of value for CMPE18 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE19_Pos            _UINT32_(19)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE19_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE19_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE19(value)         (ADCHS_ADCCMPEN1_CMPE19_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE19_Pos)) /* Assignment of value for CMPE19 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE20_Pos            _UINT32_(20)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE20_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE20_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE20(value)         (ADCHS_ADCCMPEN1_CMPE20_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE20_Pos)) /* Assignment of value for CMPE20 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE21_Pos            _UINT32_(21)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE21_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE21_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE21(value)         (ADCHS_ADCCMPEN1_CMPE21_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE21_Pos)) /* Assignment of value for CMPE21 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE22_Pos            _UINT32_(22)                                         /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE22_Msk            (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE22_Pos)        /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE22(value)         (ADCHS_ADCCMPEN1_CMPE22_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE22_Pos)) /* Assignment of value for CMPE22 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_Msk                   _UINT32_(0x007FFFFF)                                 /* (ADCHS_ADCCMPEN1) Register Mask  */

#define ADCHS_ADCCMPEN1_CMPE_Pos              _UINT32_(0)                                          /* (ADCHS_ADCCMPEN1 Position)  */
#define ADCHS_ADCCMPEN1_CMPE_Msk              (_UINT32_(0x7FFFFF) << ADCHS_ADCCMPEN1_CMPE_Pos)     /* (ADCHS_ADCCMPEN1 Mask) CMPE */
#define ADCHS_ADCCMPEN1_CMPE(value)           (ADCHS_ADCCMPEN1_CMPE_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE_Pos)) 

