Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/adchs.h
#define ADCHS_ADCCMPEN2_CMPE_Pos              _UINT32_(0)                                          /* (ADCHS_ADCCMPEN2 Position)  */
#define ADCHS_ADCCMPEN2_CMPE_Msk              (_UINT32_(0x7FFFFF) << ADCHS_ADCCMPEN2_CMPE_Pos)     /* (ADCHS_ADCCMPEN2 Mask) CMPE */
#define ADCHS_ADCCMPEN2_CMPE(value)           (ADCHS_ADCCMPEN2_CMPE_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN2_CMPE_Pos)) 

/* -------- ADCHS_ADCCMPEN1CLR : (ADCHS Offset: 0x104) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMPEN1CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCMPEN1CLR_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN1CLR) Register Mask  */


/* -------- ADCHS_ADCCMPEN1SET : (ADCHS Offset: 0x108) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMPEN1SET_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN1SET) Bit set register  Reset Value */

#define ADCHS_ADCCMPEN1SET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN1SET) Register Mask  */


/* -------- ADCHS_ADCCMPEN1INV : (ADCHS Offset: 0x10C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMPEN1INV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN1INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMPEN1INV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN1INV) Register Mask  */


/* -------- ADCHS_ADCCMP2 : (ADCHS Offset: 0x110) (R/W 32)  -------- */
#define ADCHS_ADCCMP2_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCCMP2)   Reset Value */

#define ADCHS_ADCCMP2_ADCMPLO_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCMP2)  Position */
#define ADCHS_ADCCMP2_ADCMPLO_Msk             (_UINT32_(0xFFFF) << ADCHS_ADCCMP2_ADCMPLO_Pos)      /* (ADCHS_ADCCMP2)  Mask */
#define ADCHS_ADCCMP2_ADCMPLO(value)          (ADCHS_ADCCMP2_ADCMPLO_Msk & (_UINT32_(value) << ADCHS_ADCCMP2_ADCMPLO_Pos)) /* Assignment of value for ADCMPLO in the ADCHS_ADCCMP2 register */
#define ADCHS_ADCCMP2_ADCMPHI_Pos             _UINT32_(16)                                         /* (ADCHS_ADCCMP2)  Position */
#define ADCHS_ADCCMP2_ADCMPHI_Msk             (_UINT32_(0xFFFF) << ADCHS_ADCCMP2_ADCMPHI_Pos)      /* (ADCHS_ADCCMP2)  Mask */
#define ADCHS_ADCCMP2_ADCMPHI(value)          (ADCHS_ADCCMP2_ADCMPHI_Msk & (_UINT32_(value) << ADCHS_ADCCMP2_ADCMPHI_Pos)) /* Assignment of value for ADCMPHI in the ADCHS_ADCCMP2 register */
#define ADCHS_ADCCMP2_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCCMP2) Register Mask  */


/* -------- ADCHS_ADDCMP1CLR : (ADCHS Offset: 0x114) (R/W 32) Bit clear register -------- */
#define ADCHS_ADDCMP1CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADDCMP1CLR) Bit clear register  Reset Value */

#define ADCHS_ADDCMP1CLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADDCMP1CLR) Register Mask  */


/* -------- ADCHS_ADDCMP1SET : (ADCHS Offset: 0x118) (R/W 32) Bit set register -------- */
#define ADCHS_ADDCMP1SET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADDCMP1SET) Bit set register  Reset Value */

#define ADCHS_ADDCMP1SET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADDCMP1SET) Register Mask  */


/* -------- ADCHS_ADDCMP1INV : (ADCHS Offset: 0x11C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADDCMP1INV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADDCMP1INV) Bit invert register  Reset Value */

#define ADCHS_ADDCMP1INV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADDCMP1INV) Register Mask  */


/* -------- ADCHS_ADCFLTR1 : (ADCHS Offset: 0x1A0) (R/W 32)  -------- */
#define ADCHS_ADCFLTR1_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCFLTR1)   Reset Value */

#define ADCHS_ADCFLTR1_FLT_DATA0_Pos          _UINT32_(0)                                          /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_FLT_DATA0_Msk          (_UINT32_(0xFFFF) << ADCHS_ADCFLTR1_FLT_DATA0_Pos)   /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_FLT_DATA0(value)       (ADCHS_ADCFLTR1_FLT_DATA0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_FLT_DATA0_Pos)) /* Assignment of value for FLT_DATA0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_FLTINID0_Pos           _UINT32_(16)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_FLTINID0_Msk           (_UINT32_(0x1F) << ADCHS_ADCFLTR1_FLTINID0_Pos)      /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_FLTINID0(value)        (ADCHS_ADCFLTR1_FLTINID0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_FLTINID0_Pos)) /* Assignment of value for FLTINID0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_AFIF0_Pos              _UINT32_(24)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_AFIF0_Msk              (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFIF0_Pos)          /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_AFIF0(value)           (ADCHS_ADCFLTR1_AFIF0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFIF0_Pos)) /* Assignment of value for AFIF0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_AFIEN0_Pos             _UINT32_(25)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_AFIEN0_Msk             (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFIEN0_Pos)         /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_AFIEN0(value)          (ADCHS_ADCFLTR1_AFIEN0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFIEN0_Pos)) /* Assignment of value for AFIEN0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_OVRSAM0_Pos            _UINT32_(26)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_OVRSAM0_Msk            (_UINT32_(0x7) << ADCHS_ADCFLTR1_OVRSAM0_Pos)        /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_OVRSAM0(value)         (ADCHS_ADCFLTR1_OVRSAM0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_OVRSAM0_Pos)) /* Assignment of value for OVRSAM0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_ADFMODE0_Pos           _UINT32_(29)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_ADFMODE0_Msk           (_UINT32_(0x1) << ADCHS_ADCFLTR1_ADFMODE0_Pos)       /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_ADFMODE0(value)        (ADCHS_ADCFLTR1_ADFMODE0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_ADFMODE0_Pos)) /* Assignment of value for ADFMODE0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_DATA16EN0_Pos          _UINT32_(30)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_DATA16EN0_Msk          (_UINT32_(0x1) << ADCHS_ADCFLTR1_DATA16EN0_Pos)      /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_DATA16EN0(value)       (ADCHS_ADCFLTR1_DATA16EN0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_DATA16EN0_Pos)) /* Assignment of value for DATA16EN0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_AFEN0_Pos              _UINT32_(31)                                         /* (ADCHS_ADCFLTR1)  Position */
#define ADCHS_ADCFLTR1_AFEN0_Msk              (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFEN0_Pos)          /* (ADCHS_ADCFLTR1)  Mask */
#define ADCHS_ADCFLTR1_AFEN0(value)           (ADCHS_ADCFLTR1_AFEN0_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFEN0_Pos)) /* Assignment of value for AFEN0 in the ADCHS_ADCFLTR1 register */
#define ADCHS_ADCFLTR1_Msk                    _UINT32_(0xFF1FFFFF)                                 /* (ADCHS_ADCFLTR1) Register Mask  */

#define ADCHS_ADCFLTR1_AFIF_Pos               _UINT32_(24)                                         /* (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_AFIF_Msk               (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFIF_Pos)           /* (ADCHS_ADCFLTR1 Mask) AFIF */
#define ADCHS_ADCFLTR1_AFIF(value)            (ADCHS_ADCFLTR1_AFIF_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFIF_Pos)) 
#define ADCHS_ADCFLTR1_AFIEN_Pos              _UINT32_(25)                                         /* (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_AFIEN_Msk              (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFIEN_Pos)          /* (ADCHS_ADCFLTR1 Mask) AFIEN */
#define ADCHS_ADCFLTR1_AFIEN(value)           (ADCHS_ADCFLTR1_AFIEN_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFIEN_Pos)) 
#define ADCHS_ADCFLTR1_ADFMODE_Pos            _UINT32_(29)                                         /* (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_ADFMODE_Msk            (_UINT32_(0x1) << ADCHS_ADCFLTR1_ADFMODE_Pos)        /* (ADCHS_ADCFLTR1 Mask) ADFMODE */
#define ADCHS_ADCFLTR1_ADFMODE(value)         (ADCHS_ADCFLTR1_ADFMODE_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_ADFMODE_Pos)) 
#define ADCHS_ADCFLTR1_DATA16EN_Pos           _UINT32_(30)                                         /* (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_DATA16EN_Msk           (_UINT32_(0x1) << ADCHS_ADCFLTR1_DATA16EN_Pos)       /* (ADCHS_ADCFLTR1 Mask) DATA16EN */
#define ADCHS_ADCFLTR1_DATA16EN(value)        (ADCHS_ADCFLTR1_DATA16EN_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_DATA16EN_Pos)) 
#define ADCHS_ADCFLTR1_AFEN_Pos               _UINT32_(31)                                         /* (ADCHS_ADCFLTR1 Position)  */
#define ADCHS_ADCFLTR1_AFEN_Msk               (_UINT32_(0x1) << ADCHS_ADCFLTR1_AFEN_Pos)           /* (ADCHS_ADCFLTR1 Mask) AFEN */
#define ADCHS_ADCFLTR1_AFEN(value)            (ADCHS_ADCFLTR1_AFEN_Msk & (_UINT32_(value) << ADCHS_ADCFLTR1_AFEN_Pos)) 

