Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/adchs.h
/* -------- ADCHS_ADCTRG1CLR : (ADCHS Offset: 0x204) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCTRG1CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCTRG1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCTRG1CLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCTRG1CLR) Register Mask  */


/* -------- ADCHS_ADCTRG1SET : (ADCHS Offset: 0x208) (R/W 32) Bit set register -------- */
#define ADCHS_ADCTRG1SET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCTRG1SET) Bit set register  Reset Value */

#define ADCHS_ADCTRG1SET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCTRG1SET) Register Mask  */


/* -------- ADCHS_ADCTRG1INV : (ADCHS Offset: 0x20C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCTRG1INV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCTRG1INV) Bit invert register  Reset Value */

#define ADCHS_ADCTRG1INV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCTRG1INV) Register Mask  */


/* -------- ADCHS_ADCTRG2 : (ADCHS Offset: 0x210) (R/W 32) ADC Trigger Source 2 Register -------- */
#define ADCHS_ADCTRG2_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCTRG2) ADC Trigger Source 2 Register  Reset Value */

#define ADCHS_ADCTRG2_TRGSRC4_Pos             _UINT32_(0)                                          /* (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC4 Module Select bits Position */
#define ADCHS_ADCTRG2_TRGSRC4_Msk             (_UINT32_(0x1F) << ADCHS_ADCTRG2_TRGSRC4_Pos)        /* (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC4 Module Select bits Mask */
#define ADCHS_ADCTRG2_TRGSRC4(value)          (ADCHS_ADCTRG2_TRGSRC4_Msk & (_UINT32_(value) << ADCHS_ADCTRG2_TRGSRC4_Pos)) /* Assignment of value for TRGSRC4 in the ADCHS_ADCTRG2 register */
#define   ADCHS_ADCTRG2_TRGSRC4_RESERVED_Val  _UINT32_(0x1F)                                       /* (ADCHS_ADCTRG2) RESERVED  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_53_Val  _UINT32_(0x10)                                       /* (ADCHS_ADCTRG2) ADC_TRIG_16  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_52_Val  _UINT32_(0xF)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_15  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_51_Val  _UINT32_(0xE)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_14  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_50_Val  _UINT32_(0xD)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_13  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_49_Val  _UINT32_(0xC)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_12  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_48_Val  _UINT32_(0xB)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_11  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_47_Val  _UINT32_(0xA)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_10  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_46_Val  _UINT32_(0x9)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_9  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_45_Val  _UINT32_(0x8)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_8  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_44_Val  _UINT32_(0x7)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_7  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_43_Val  _UINT32_(0x6)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_6  */
#define   ADCHS_ADCTRG2_TRGSRC4_EVSYS_42_Val  _UINT32_(0x5)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_5  */
#define   ADCHS_ADCTRG2_TRGSRC4_INT0_Val      _UINT32_(0x4)                                        /* (ADCHS_ADCTRG2) INT0  */
#define   ADCHS_ADCTRG2_TRGSRC4_SCAN_TRIG_Val _UINT32_(0x3)                                        /* (ADCHS_ADCTRG2) Scan trigger  */
#define   ADCHS_ADCTRG2_TRGSRC4_SW_LVL_Val    _UINT32_(0x2)                                        /* (ADCHS_ADCTRG2) Software level trigger  */
#define   ADCHS_ADCTRG2_TRGSRC4_SW_EDGE_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCTRG2) Software edge trigger  */
#define   ADCHS_ADCTRG2_TRGSRC4_NONE_Val      _UINT32_(0x0)                                        /* (ADCHS_ADCTRG2) No Trigger  */
#define ADCHS_ADCTRG2_TRGSRC4_RESERVED        (ADCHS_ADCTRG2_TRGSRC4_RESERVED_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) RESERVED Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_53        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_53_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_16 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_52        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_52_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_15 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_51        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_51_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_14 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_50        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_50_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_13 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_49        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_49_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_12 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_48        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_48_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_11 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_47        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_47_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_10 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_46        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_46_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_9 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_45        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_45_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_8 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_44        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_44_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_7 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_43        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_43_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_6 Position */
#define ADCHS_ADCTRG2_TRGSRC4_EVSYS_42        (ADCHS_ADCTRG2_TRGSRC4_EVSYS_42_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_5 Position */
#define ADCHS_ADCTRG2_TRGSRC4_INT0            (ADCHS_ADCTRG2_TRGSRC4_INT0_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) INT0 Position */
#define ADCHS_ADCTRG2_TRGSRC4_SCAN_TRIG       (ADCHS_ADCTRG2_TRGSRC4_SCAN_TRIG_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) Scan trigger Position */
#define ADCHS_ADCTRG2_TRGSRC4_SW_LVL          (ADCHS_ADCTRG2_TRGSRC4_SW_LVL_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) Software level trigger Position */
#define ADCHS_ADCTRG2_TRGSRC4_SW_EDGE         (ADCHS_ADCTRG2_TRGSRC4_SW_EDGE_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) Software edge trigger Position */
#define ADCHS_ADCTRG2_TRGSRC4_NONE            (ADCHS_ADCTRG2_TRGSRC4_NONE_Val << ADCHS_ADCTRG2_TRGSRC4_Pos) /* (ADCHS_ADCTRG2) No Trigger Position */
#define ADCHS_ADCTRG2_TRGSRC6_Pos             _UINT32_(0)                                          /* (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC6 Module Select bits Position */
#define ADCHS_ADCTRG2_TRGSRC6_Msk             (_UINT32_(0x1F) << ADCHS_ADCTRG2_TRGSRC6_Pos)        /* (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC6 Module Select bits Mask */
#define ADCHS_ADCTRG2_TRGSRC6(value)          (ADCHS_ADCTRG2_TRGSRC6_Msk & (_UINT32_(value) << ADCHS_ADCTRG2_TRGSRC6_Pos)) /* Assignment of value for TRGSRC6 in the ADCHS_ADCTRG2 register */
#define   ADCHS_ADCTRG2_TRGSRC6_RESERVED_Val  _UINT32_(0x1F)                                       /* (ADCHS_ADCTRG2) RESERVED  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_53_Val  _UINT32_(0x10)                                       /* (ADCHS_ADCTRG2) ADC_TRIG_16  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_52_Val  _UINT32_(0xF)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_15  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_51_Val  _UINT32_(0xE)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_14  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_50_Val  _UINT32_(0xD)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_13  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_49_Val  _UINT32_(0xC)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_12  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_48_Val  _UINT32_(0xB)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_11  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_47_Val  _UINT32_(0xA)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_10  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_46_Val  _UINT32_(0x9)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_9  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_45_Val  _UINT32_(0x8)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_8  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_44_Val  _UINT32_(0x7)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_7  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_43_Val  _UINT32_(0x6)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_6  */
#define   ADCHS_ADCTRG2_TRGSRC6_EVSYS_42_Val  _UINT32_(0x5)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_5  */
#define   ADCHS_ADCTRG2_TRGSRC6_INT0_Val      _UINT32_(0x4)                                        /* (ADCHS_ADCTRG2) INT0  */
#define   ADCHS_ADCTRG2_TRGSRC6_SCAN_TRIG_Val _UINT32_(0x3)                                        /* (ADCHS_ADCTRG2) Scan trigger  */
#define   ADCHS_ADCTRG2_TRGSRC6_SW_LVL_Val    _UINT32_(0x2)                                        /* (ADCHS_ADCTRG2) Software level trigger  */
#define   ADCHS_ADCTRG2_TRGSRC6_SW_EDGE_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCTRG2) Software edge trigger  */
#define   ADCHS_ADCTRG2_TRGSRC6_NONE_Val      _UINT32_(0x0)                                        /* (ADCHS_ADCTRG2) No Trigger  */
#define ADCHS_ADCTRG2_TRGSRC6_RESERVED        (ADCHS_ADCTRG2_TRGSRC6_RESERVED_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) RESERVED Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_53        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_53_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_16 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_52        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_52_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_15 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_51        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_51_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_14 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_50        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_50_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_13 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_49        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_49_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_12 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_48        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_48_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_11 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_47        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_47_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_10 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_46        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_46_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_9 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_45        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_45_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_8 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_44        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_44_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_7 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_43        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_43_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_6 Position */
#define ADCHS_ADCTRG2_TRGSRC6_EVSYS_42        (ADCHS_ADCTRG2_TRGSRC6_EVSYS_42_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_5 Position */
#define ADCHS_ADCTRG2_TRGSRC6_INT0            (ADCHS_ADCTRG2_TRGSRC6_INT0_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) INT0 Position */
#define ADCHS_ADCTRG2_TRGSRC6_SCAN_TRIG       (ADCHS_ADCTRG2_TRGSRC6_SCAN_TRIG_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) Scan trigger Position */
#define ADCHS_ADCTRG2_TRGSRC6_SW_LVL          (ADCHS_ADCTRG2_TRGSRC6_SW_LVL_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) Software level trigger Position */
#define ADCHS_ADCTRG2_TRGSRC6_SW_EDGE         (ADCHS_ADCTRG2_TRGSRC6_SW_EDGE_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) Software edge trigger Position */
#define ADCHS_ADCTRG2_TRGSRC6_NONE            (ADCHS_ADCTRG2_TRGSRC6_NONE_Val << ADCHS_ADCTRG2_TRGSRC6_Pos) /* (ADCHS_ADCTRG2) No Trigger Position */
#define ADCHS_ADCTRG2_TRGSRC5_Pos             _UINT32_(8)                                          /* (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC5 Module Select bits Position */
#define ADCHS_ADCTRG2_TRGSRC5_Msk             (_UINT32_(0x1F) << ADCHS_ADCTRG2_TRGSRC5_Pos)        /* (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC5 Module Select bits Mask */
#define ADCHS_ADCTRG2_TRGSRC5(value)          (ADCHS_ADCTRG2_TRGSRC5_Msk & (_UINT32_(value) << ADCHS_ADCTRG2_TRGSRC5_Pos)) /* Assignment of value for TRGSRC5 in the ADCHS_ADCTRG2 register */
#define   ADCHS_ADCTRG2_TRGSRC5_RESERVED_Val  _UINT32_(0x1F)                                       /* (ADCHS_ADCTRG2) RESERVED  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_53_Val  _UINT32_(0x10)                                       /* (ADCHS_ADCTRG2) ADC_TRIG_16  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_52_Val  _UINT32_(0xF)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_15  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_51_Val  _UINT32_(0xE)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_14  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_50_Val  _UINT32_(0xD)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_13  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_49_Val  _UINT32_(0xC)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_12  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_48_Val  _UINT32_(0xB)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_11  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_47_Val  _UINT32_(0xA)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_10  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_46_Val  _UINT32_(0x9)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_9  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_45_Val  _UINT32_(0x8)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_8  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_44_Val  _UINT32_(0x7)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_7  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_43_Val  _UINT32_(0x6)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_6  */
#define   ADCHS_ADCTRG2_TRGSRC5_EVSYS_42_Val  _UINT32_(0x5)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_5  */
#define   ADCHS_ADCTRG2_TRGSRC5_INT0_Val      _UINT32_(0x4)                                        /* (ADCHS_ADCTRG2) INT0  */
#define   ADCHS_ADCTRG2_TRGSRC5_SCAN_TRIG_Val _UINT32_(0x3)                                        /* (ADCHS_ADCTRG2) Scan trigger  */
#define   ADCHS_ADCTRG2_TRGSRC5_SW_LVL_Val    _UINT32_(0x2)                                        /* (ADCHS_ADCTRG2) Software level trigger  */
#define   ADCHS_ADCTRG2_TRGSRC5_SW_EDGE_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCTRG2) Software edge trigger  */
#define   ADCHS_ADCTRG2_TRGSRC5_NONE_Val      _UINT32_(0x0)                                        /* (ADCHS_ADCTRG2) No Trigger  */
#define ADCHS_ADCTRG2_TRGSRC5_RESERVED        (ADCHS_ADCTRG2_TRGSRC5_RESERVED_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) RESERVED Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_53        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_53_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_16 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_52        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_52_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_15 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_51        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_51_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_14 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_50        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_50_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_13 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_49        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_49_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_12 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_48        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_48_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_11 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_47        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_47_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_10 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_46        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_46_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_9 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_45        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_45_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_8 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_44        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_44_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_7 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_43        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_43_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_6 Position */
#define ADCHS_ADCTRG2_TRGSRC5_EVSYS_42        (ADCHS_ADCTRG2_TRGSRC5_EVSYS_42_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_5 Position */
#define ADCHS_ADCTRG2_TRGSRC5_INT0            (ADCHS_ADCTRG2_TRGSRC5_INT0_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) INT0 Position */
#define ADCHS_ADCTRG2_TRGSRC5_SCAN_TRIG       (ADCHS_ADCTRG2_TRGSRC5_SCAN_TRIG_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) Scan trigger Position */
#define ADCHS_ADCTRG2_TRGSRC5_SW_LVL          (ADCHS_ADCTRG2_TRGSRC5_SW_LVL_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) Software level trigger Position */
#define ADCHS_ADCTRG2_TRGSRC5_SW_EDGE         (ADCHS_ADCTRG2_TRGSRC5_SW_EDGE_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) Software edge trigger Position */
#define ADCHS_ADCTRG2_TRGSRC5_NONE            (ADCHS_ADCTRG2_TRGSRC5_NONE_Val << ADCHS_ADCTRG2_TRGSRC5_Pos) /* (ADCHS_ADCTRG2) No Trigger Position */
#define ADCHS_ADCTRG2_TRGSRC7_Pos             _UINT32_(8)                                          /* (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC7 Module Select bits Position */
#define ADCHS_ADCTRG2_TRGSRC7_Msk             (_UINT32_(0x1F) << ADCHS_ADCTRG2_TRGSRC7_Pos)        /* (ADCHS_ADCTRG2) Trigger Source for Conversion of ADC7 Module Select bits Mask */
#define ADCHS_ADCTRG2_TRGSRC7(value)          (ADCHS_ADCTRG2_TRGSRC7_Msk & (_UINT32_(value) << ADCHS_ADCTRG2_TRGSRC7_Pos)) /* Assignment of value for TRGSRC7 in the ADCHS_ADCTRG2 register */
#define   ADCHS_ADCTRG2_TRGSRC7_RESERVED_Val  _UINT32_(0x1F)                                       /* (ADCHS_ADCTRG2) RESERVED  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_53_Val  _UINT32_(0x10)                                       /* (ADCHS_ADCTRG2) ADC_TRIG_16  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_52_Val  _UINT32_(0xF)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_15  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_51_Val  _UINT32_(0xE)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_14  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_50_Val  _UINT32_(0xD)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_13  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_49_Val  _UINT32_(0xC)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_12  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_48_Val  _UINT32_(0xB)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_11  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_47_Val  _UINT32_(0xA)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_10  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_46_Val  _UINT32_(0x9)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_9  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_45_Val  _UINT32_(0x8)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_8  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_44_Val  _UINT32_(0x7)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_7  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_43_Val  _UINT32_(0x6)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_6  */
#define   ADCHS_ADCTRG2_TRGSRC7_EVSYS_42_Val  _UINT32_(0x5)                                        /* (ADCHS_ADCTRG2) ADC_TRIG_5  */
#define   ADCHS_ADCTRG2_TRGSRC7_INT0_Val      _UINT32_(0x4)                                        /* (ADCHS_ADCTRG2) INT0  */
#define   ADCHS_ADCTRG2_TRGSRC7_SCAN_TRIG_Val _UINT32_(0x3)                                        /* (ADCHS_ADCTRG2) Scan trigger  */
#define   ADCHS_ADCTRG2_TRGSRC7_SW_LVL_Val    _UINT32_(0x2)                                        /* (ADCHS_ADCTRG2) Software level trigger  */
#define   ADCHS_ADCTRG2_TRGSRC7_SW_EDGE_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCTRG2) Software edge trigger  */
#define   ADCHS_ADCTRG2_TRGSRC7_NONE_Val      _UINT32_(0x0)                                        /* (ADCHS_ADCTRG2) No Trigger  */
#define ADCHS_ADCTRG2_TRGSRC7_RESERVED        (ADCHS_ADCTRG2_TRGSRC7_RESERVED_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) RESERVED Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_53        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_53_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_16 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_52        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_52_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_15 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_51        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_51_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_14 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_50        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_50_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_13 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_49        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_49_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_12 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_48        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_48_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_11 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_47        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_47_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_10 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_46        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_46_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_9 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_45        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_45_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_8 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_44        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_44_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_7 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_43        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_43_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_6 Position */
#define ADCHS_ADCTRG2_TRGSRC7_EVSYS_42        (ADCHS_ADCTRG2_TRGSRC7_EVSYS_42_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) ADC_TRIG_5 Position */
#define ADCHS_ADCTRG2_TRGSRC7_INT0            (ADCHS_ADCTRG2_TRGSRC7_INT0_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) INT0 Position */
