Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/adchs.h
#define ADCHS_ADCTRG2_TRGSRC7_SCAN_TRIG       (ADCHS_ADCTRG2_TRGSRC7_SCAN_TRIG_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) Scan trigger Position */
#define ADCHS_ADCTRG2_TRGSRC7_SW_LVL          (ADCHS_ADCTRG2_TRGSRC7_SW_LVL_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) Software level trigger Position */
#define ADCHS_ADCTRG2_TRGSRC7_SW_EDGE         (ADCHS_ADCTRG2_TRGSRC7_SW_EDGE_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) Software edge trigger Position */
#define ADCHS_ADCTRG2_TRGSRC7_NONE            (ADCHS_ADCTRG2_TRGSRC7_NONE_Val << ADCHS_ADCTRG2_TRGSRC7_Pos) /* (ADCHS_ADCTRG2) No Trigger Position */
#define ADCHS_ADCTRG2_Msk                     _UINT32_(0x00001F1F)                                 /* (ADCHS_ADCTRG2) Register Mask  */


/* -------- ADCHS_ADTRG2CLR : (ADCHS Offset: 0x214) (R/W 32) Bit clear register -------- */
#define ADCHS_ADTRG2CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADTRG2CLR) Bit clear register  Reset Value */

#define ADCHS_ADTRG2CLR_Msk                   _UINT32_(0x00000000)                                 /* (ADCHS_ADTRG2CLR) Register Mask  */


/* -------- ADCHS_ADTRG2SET : (ADCHS Offset: 0x218) (R/W 32) Bit set register -------- */
#define ADCHS_ADTRG2SET_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADTRG2SET) Bit set register  Reset Value */

#define ADCHS_ADTRG2SET_Msk                   _UINT32_(0x00000000)                                 /* (ADCHS_ADTRG2SET) Register Mask  */


/* -------- ADCHS_ADTRG2INV : (ADCHS Offset: 0x21C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADTRG2INV_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADTRG2INV) Bit invert register  Reset Value */

#define ADCHS_ADTRG2INV_Msk                   _UINT32_(0x00000000)                                 /* (ADCHS_ADTRG2INV) Register Mask  */


/* -------- ADCHS_ADTRG3CLR : (ADCHS Offset: 0x224) (R/W 32) Bit clear register -------- */
#define ADCHS_ADTRG3CLR_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADTRG3CLR) Bit clear register  Reset Value */

#define ADCHS_ADTRG3CLR_Msk                   _UINT32_(0x00000000)                                 /* (ADCHS_ADTRG3CLR) Register Mask  */


/* -------- ADCHS_ADTRG3SET : (ADCHS Offset: 0x228) (R/W 32) Bit set register -------- */
#define ADCHS_ADTRG3SET_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADTRG3SET) Bit set register  Reset Value */

#define ADCHS_ADTRG3SET_Msk                   _UINT32_(0x00000000)                                 /* (ADCHS_ADTRG3SET) Register Mask  */


/* -------- ADCHS_ADTRG3INV : (ADCHS Offset: 0x22C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADTRG3INV_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADTRG3INV) Bit invert register  Reset Value */

#define ADCHS_ADTRG3INV_Msk                   _UINT32_(0x00000000)                                 /* (ADCHS_ADTRG3INV) Register Mask  */


/* -------- ADCHS_ADCCMPCON1 : (ADCHS Offset: 0x280) (R/W 32)  -------- */
#define ADCHS_ADCCMPCON1_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPCON1)   Reset Value */

#define ADCHS_ADCCMPCON1_IELOLO_Pos           _UINT32_(0)                                          /* (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_IELOLO_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON1_IELOLO_Pos)       /* (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_IELOLO(value)        (ADCHS_ADCCMPCON1_IELOLO_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON1_IELOLO_Pos)) /* Assignment of value for IELOLO in the ADCHS_ADCCMPCON1 register */
#define ADCHS_ADCCMPCON1_IELOHI_Pos           _UINT32_(1)                                          /* (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_IELOHI_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON1_IELOHI_Pos)       /* (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_IELOHI(value)        (ADCHS_ADCCMPCON1_IELOHI_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON1_IELOHI_Pos)) /* Assignment of value for IELOHI in the ADCHS_ADCCMPCON1 register */
#define ADCHS_ADCCMPCON1_IEHILO_Pos           _UINT32_(2)                                          /* (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_IEHILO_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON1_IEHILO_Pos)       /* (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_IEHILO(value)        (ADCHS_ADCCMPCON1_IEHILO_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON1_IEHILO_Pos)) /* Assignment of value for IEHILO in the ADCHS_ADCCMPCON1 register */
#define ADCHS_ADCCMPCON1_IEHIHI_Pos           _UINT32_(3)                                          /* (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_IEHIHI_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON1_IEHIHI_Pos)       /* (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_IEHIHI(value)        (ADCHS_ADCCMPCON1_IEHIHI_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON1_IEHIHI_Pos)) /* Assignment of value for IEHIHI in the ADCHS_ADCCMPCON1 register */
#define ADCHS_ADCCMPCON1_IEBTWN_Pos           _UINT32_(4)                                          /* (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_IEBTWN_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON1_IEBTWN_Pos)       /* (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_IEBTWN(value)        (ADCHS_ADCCMPCON1_IEBTWN_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON1_IEBTWN_Pos)) /* Assignment of value for IEBTWN in the ADCHS_ADCCMPCON1 register */
#define ADCHS_ADCCMPCON1_DCMPED_Pos           _UINT32_(5)                                          /* (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_DCMPED_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON1_DCMPED_Pos)       /* (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_DCMPED(value)        (ADCHS_ADCCMPCON1_DCMPED_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON1_DCMPED_Pos)) /* Assignment of value for DCMPED in the ADCHS_ADCCMPCON1 register */
#define ADCHS_ADCCMPCON1_DCMPIEN_Pos          _UINT32_(6)                                          /* (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_DCMPIEN_Msk          (_UINT32_(0x1) << ADCHS_ADCCMPCON1_DCMPIEN_Pos)      /* (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_DCMPIEN(value)       (ADCHS_ADCCMPCON1_DCMPIEN_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON1_DCMPIEN_Pos)) /* Assignment of value for DCMPIEN in the ADCHS_ADCCMPCON1 register */
#define ADCHS_ADCCMPCON1_ENDCMP_Pos           _UINT32_(7)                                          /* (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_ENDCMP_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON1_ENDCMP_Pos)       /* (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_ENDCMP(value)        (ADCHS_ADCCMPCON1_ENDCMP_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON1_ENDCMP_Pos)) /* Assignment of value for ENDCMP in the ADCHS_ADCCMPCON1 register */
#define ADCHS_ADCCMPCON1_CMPINID0_Pos         _UINT32_(8)                                          /* (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_CMPINID0_Msk         (_UINT32_(0x3F) << ADCHS_ADCCMPCON1_CMPINID0_Pos)    /* (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_CMPINID0(value)      (ADCHS_ADCCMPCON1_CMPINID0_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON1_CMPINID0_Pos)) /* Assignment of value for CMPINID0 in the ADCHS_ADCCMPCON1 register */
#define ADCHS_ADCCMPCON1_CVD_DATA_Pos         _UINT32_(16)                                         /* (ADCHS_ADCCMPCON1)  Position */
#define ADCHS_ADCCMPCON1_CVD_DATA_Msk         (_UINT32_(0xFFFF) << ADCHS_ADCCMPCON1_CVD_DATA_Pos)  /* (ADCHS_ADCCMPCON1)  Mask */
#define ADCHS_ADCCMPCON1_CVD_DATA(value)      (ADCHS_ADCCMPCON1_CVD_DATA_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON1_CVD_DATA_Pos)) /* Assignment of value for CVD_DATA in the ADCHS_ADCCMPCON1 register */
#define ADCHS_ADCCMPCON1_Msk                  _UINT32_(0xFFFF3FFF)                                 /* (ADCHS_ADCCMPCON1) Register Mask  */


/* -------- ADCHS_ADCCMPCON1CLR : (ADCHS Offset: 0x284) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMPCON1CLR_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPCON1CLR) Bit clear register  Reset Value */

