Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/adchs.h
#define ADCHS_ADCTRGSNS_LVL0_Pos              _UINT32_(0)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL0_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL0_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL0(value)           (ADCHS_ADCTRGSNS_LVL0_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL0_Pos)) /* Assignment of value for LVL0 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL1_Pos              _UINT32_(1)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL1_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL1_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL1(value)           (ADCHS_ADCTRGSNS_LVL1_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL1_Pos)) /* Assignment of value for LVL1 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL2_Pos              _UINT32_(2)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL2_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL2_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL2(value)           (ADCHS_ADCTRGSNS_LVL2_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL2_Pos)) /* Assignment of value for LVL2 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL3_Pos              _UINT32_(3)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL3_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL3_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL3(value)           (ADCHS_ADCTRGSNS_LVL3_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL3_Pos)) /* Assignment of value for LVL3 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL4_Pos              _UINT32_(4)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL4_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL4_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL4(value)           (ADCHS_ADCTRGSNS_LVL4_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL4_Pos)) /* Assignment of value for LVL4 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL5_Pos              _UINT32_(5)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL5_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL5_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL5(value)           (ADCHS_ADCTRGSNS_LVL5_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL5_Pos)) /* Assignment of value for LVL5 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL6_Pos              _UINT32_(6)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL6_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL6_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL6(value)           (ADCHS_ADCTRGSNS_LVL6_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL6_Pos)) /* Assignment of value for LVL6 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL7_Pos              _UINT32_(7)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL7_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL7_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL7(value)           (ADCHS_ADCTRGSNS_LVL7_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL7_Pos)) /* Assignment of value for LVL7 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_Msk                   _UINT32_(0x000000FF)                                 /* (ADCHS_ADCTRGSNS) Register Mask  */

#define ADCHS_ADCTRGSNS_LVL_Pos               _UINT32_(0)                                          /* (ADCHS_ADCTRGSNS Position)  */
#define ADCHS_ADCTRGSNS_LVL_Msk               (_UINT32_(0xFF) << ADCHS_ADCTRGSNS_LVL_Pos)          /* (ADCHS_ADCTRGSNS Mask) LVL */
#define ADCHS_ADCTRGSNS_LVL(value)            (ADCHS_ADCTRGSNS_LVL_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL_Pos)) 

/* -------- ADCHS_ADCTRGSNSCLR : (ADCHS Offset: 0x344) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCTRGSNSCLR_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCTRGSNSCLR) Bit clear register  Reset Value */

#define ADCHS_ADCTRGSNSCLR_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCTRGSNSCLR) Register Mask  */


/* -------- ADCHS_ADCTRGSNSSET : (ADCHS Offset: 0x348) (R/W 32) Bit set register -------- */
#define ADCHS_ADCTRGSNSSET_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCTRGSNSSET) Bit set register  Reset Value */

#define ADCHS_ADCTRGSNSSET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCTRGSNSSET) Register Mask  */


/* -------- ADCHS_ADCTRGSNSINV : (ADCHS Offset: 0x34C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCTRGSNSINV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCTRGSNSINV) Bit invert register  Reset Value */

#define ADCHS_ADCTRGSNSINV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCTRGSNSINV) Register Mask  */


/* -------- ADCHS_ADC0TIME : (ADCHS Offset: 0x350) (R/W 32) Dedicated High-Speed ADC Timing Register ('x' = 0) -------- */
#define ADCHS_ADC0TIME_SAMC_Pos               _UINT32_(0)                                          /* (ADCHS_ADC0TIME) ADCx Sample Time bits Position */
#define ADCHS_ADC0TIME_SAMC_Msk               (_UINT32_(0x3FF) << ADCHS_ADC0TIME_SAMC_Pos)         /* (ADCHS_ADC0TIME) ADCx Sample Time bits Mask */
#define ADCHS_ADC0TIME_SAMC(value)            (ADCHS_ADC0TIME_SAMC_Msk & (_UINT32_(value) << ADCHS_ADC0TIME_SAMC_Pos)) /* Assignment of value for SAMC in the ADCHS_ADC0TIME register */
#define ADCHS_ADC0TIME_ADCDIV_Pos             _UINT32_(16)                                         /* (ADCHS_ADC0TIME) ADCx Clock Divisor bits Position */
#define ADCHS_ADC0TIME_ADCDIV_Msk             (_UINT32_(0x7F) << ADCHS_ADC0TIME_ADCDIV_Pos)        /* (ADCHS_ADC0TIME) ADCx Clock Divisor bits Mask */
#define ADCHS_ADC0TIME_ADCDIV(value)          (ADCHS_ADC0TIME_ADCDIV_Msk & (_UINT32_(value) << ADCHS_ADC0TIME_ADCDIV_Pos)) /* Assignment of value for ADCDIV in the ADCHS_ADC0TIME register */
#define ADCHS_ADC0TIME_BCHEN_Pos              _UINT32_(23)                                         /* (ADCHS_ADC0TIME) Buffer Channel Enable bit Position */
#define ADCHS_ADC0TIME_BCHEN_Msk              (_UINT32_(0x1) << ADCHS_ADC0TIME_BCHEN_Pos)          /* (ADCHS_ADC0TIME) Buffer Channel Enable bit Mask */
#define ADCHS_ADC0TIME_BCHEN(value)           (ADCHS_ADC0TIME_BCHEN_Msk & (_UINT32_(value) << ADCHS_ADC0TIME_BCHEN_Pos)) /* Assignment of value for BCHEN in the ADCHS_ADC0TIME register */
#define ADCHS_ADC0TIME_SELRES_Pos             _UINT32_(24)                                         /* (ADCHS_ADC0TIME) ADCx Resolution Select bits Position */
#define ADCHS_ADC0TIME_SELRES_Msk             (_UINT32_(0x3) << ADCHS_ADC0TIME_SELRES_Pos)         /* (ADCHS_ADC0TIME) ADCx Resolution Select bits Mask */
#define ADCHS_ADC0TIME_SELRES(value)          (ADCHS_ADC0TIME_SELRES_Msk & (_UINT32_(value) << ADCHS_ADC0TIME_SELRES_Pos)) /* Assignment of value for SELRES in the ADCHS_ADC0TIME register */
#define   ADCHS_ADC0TIME_SELRES_12_BITS_Val   _UINT32_(0x3)                                        /* (ADCHS_ADC0TIME) 12 bits  */
#define   ADCHS_ADC0TIME_SELRES_10_BITS_Val   _UINT32_(0x2)                                        /* (ADCHS_ADC0TIME) 10 bits  */
#define   ADCHS_ADC0TIME_SELRES_8_BITS_Val    _UINT32_(0x1)                                        /* (ADCHS_ADC0TIME) 8 bits  */
#define   ADCHS_ADC0TIME_SELRES_6_BITS_Val    _UINT32_(0x0)                                        /* (ADCHS_ADC0TIME) 6 bits  */
#define ADCHS_ADC0TIME_SELRES_12_BITS         (ADCHS_ADC0TIME_SELRES_12_BITS_Val << ADCHS_ADC0TIME_SELRES_Pos) /* (ADCHS_ADC0TIME) 12 bits Position */
#define ADCHS_ADC0TIME_SELRES_10_BITS         (ADCHS_ADC0TIME_SELRES_10_BITS_Val << ADCHS_ADC0TIME_SELRES_Pos) /* (ADCHS_ADC0TIME) 10 bits Position */
#define ADCHS_ADC0TIME_SELRES_8_BITS          (ADCHS_ADC0TIME_SELRES_8_BITS_Val << ADCHS_ADC0TIME_SELRES_Pos) /* (ADCHS_ADC0TIME) 8 bits Position */
#define ADCHS_ADC0TIME_SELRES_6_BITS          (ADCHS_ADC0TIME_SELRES_6_BITS_Val << ADCHS_ADC0TIME_SELRES_Pos) /* (ADCHS_ADC0TIME) 6 bits Position */
#define ADCHS_ADC0TIME_ADCEIS_Pos             _UINT32_(26)                                         /* (ADCHS_ADC0TIME) ADCx Early Interrupt Select bits Position */
#define ADCHS_ADC0TIME_ADCEIS_Msk             (_UINT32_(0x7) << ADCHS_ADC0TIME_ADCEIS_Pos)         /* (ADCHS_ADC0TIME) ADCx Early Interrupt Select bits Mask */
#define ADCHS_ADC0TIME_ADCEIS(value)          (ADCHS_ADC0TIME_ADCEIS_Msk & (_UINT32_(value) << ADCHS_ADC0TIME_ADCEIS_Pos)) /* Assignment of value for ADCEIS in the ADCHS_ADC0TIME register */
#define ADCHS_ADC0TIME_Msk                    _UINT32_(0x1FFF03FF)                                 /* (ADCHS_ADC0TIME) Register Mask  */


